In [39]:
import pandas as pd
import numpy as np

In [40]:
people = {
    'first' : ['Corey',"Jane",'John','Chris',np.nan,None,'NA'],
    'last' : ['Schafer','Doe','Doe',np.nan,np.nan,None,'Missing'],
    'email' : ['CoreyMSchafer@gmail.com','JaneDoe@gmail.com','JhonDoe@gmail.com',None,np.nan, 'Anonymous@email.com', 'NA'],
    'age' : ['33','55','63','36',None,None,"Missing"]
}

In [41]:
df = pd.DataFrame(people)
df.replace('NA',np.nan,inplace=True)
df.replace('Missing',np.nan,inplace=True)

In [42]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JhonDoe@gmail.com    63
3  Chris      NaN                     None    36
4    NaN      NaN                      NaN  None
5   None     None      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [43]:
df.dropna()

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@gmail.com  55
2   John      Doe        JhonDoe@gmail.com  63

In [44]:
df.dropna(axis='index',how='any')  ## default

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@gmail.com  55
2   John      Doe        JhonDoe@gmail.com  63

In [45]:
df.dropna(axis='index',how='all')

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JhonDoe@gmail.com    63
3  Chris      NaN                     None    36
5   None     None      Anonymous@email.com  None

In [46]:
df.dropna(axis='columns',how='all')

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JhonDoe@gmail.com    63
3  Chris      NaN                     None    36
4    NaN      NaN                      NaN  None
5   None     None      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [47]:
df.dropna(axis='columns',how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [48]:
df.dropna(axis='index',how='any',subset=['email'])

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JhonDoe@gmail.com    63
5   None     None      Anonymous@email.com  None

In [49]:
df.dropna(axis='index',how='any',subset=['last','email'])

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@gmail.com  55
2   John      Doe        JhonDoe@gmail.com  63

In [50]:
df.dropna(axis='index',how='all',subset=['last','email'])

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JhonDoe@gmail.com    63
5   None     None      Anonymous@email.com  None

In [51]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False   True   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [52]:
df.fillna('MISSING')

     first     last                    email      age
0    Corey  Schafer  CoreyMSchafer@gmail.com       33
1     Jane      Doe        JaneDoe@gmail.com       55
2     John      Doe        JhonDoe@gmail.com       63
3    Chris  MISSING                  MISSING       36
4  MISSING  MISSING                  MISSING  MISSING
5  MISSING  MISSING      Anonymous@email.com  MISSING
6  MISSING  MISSING                  MISSING  MISSING

In [53]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [54]:
df['age'].mean()

TypeError: can only concatenate str (not "int") to str

In [55]:
type(np.nan)

float

In [56]:
df['age'] = df['age'].astype(float)

In [57]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [59]:
df['age'].mean()

46.75